import 'package:Basic_network_app/Quiz/quiz_U4/models/question4.dart';

const List<Question4> questions4 = [
  Question4(
    question4: '1.สายที่มีตัวนำที่เป็นลวดทองแดงตรงกลางเเละมีฉนวนพลาสติกหนาหุ้มลวดตัวนำ คือสายชนิดใด?',
    correctAnswerIndex4: 0,
    options4: [
      'a) สายโคเเอกเซียล',
      'b) สายใยแก้วนำแสง',
      'c) สายคู่บิดเกลียว',
      'd) สายนำชนิดพลาสติก',
    ],
  ),
  Question4(
    question4: '2.ข้อใดบอกวิธีการเชื่อมต่อสายโคแอกเซียล ได้ถูกต้อง?',
    correctAnswerIndex4: 3,
    options4: [
      'a) ใช้หัวต่อแบบ SC',
      'b) ใช้หัวต่อแบบ Terminal',
      'c) ใช้หัวต่อ RJ-45',
      'd) ใช้หัวต่อ BNC Connector',
    ],
  ),
  Question4(
    question4: '3.ข้อใดบอกวิธีการเชื่อมต่อสายคู่ตีเกลียว ได้ถูกต้อง?',
    correctAnswerIndex4: 2,
    options4: [
      'a) ใช้หัวต่อแบบ SC',
      'b) ใช้หัวต่อแบบ Terminal',
      'c) ใช้หัวต่อ RJ-45',
      'd) ใช้หัวต่อ BNC Connector',
    ],
  ),
  Question4(
    question4: '4.ข้อใดบอกวิธีการเชื่อมต่อสายใยแก้วนำแสง ได้ถูกต้อง?',
    correctAnswerIndex4: 1,
    options4: [
      'a) ใช้หัวต่อ BNC Connector',
      'b) หัวต่อแบบ SC,ST และแบบ FC',
      'c) ใช้หัวต่อแบบ Terminal',
      'd) ใช้หัวต่อ RJ-45',
    ],
  ),
  Question4(
    question4: '5.สายที่มีลวดทองแดง 2 เส้น พันกันเป็นเกลียวคู่ คือสายชนิดใด?',
    correctAnswerIndex4: 1,
    options4: [
      'a) สายโคเเอกเซียลแบบบาง',
      'b) สายคู่บิดเกลียว',
      'c) สายใยแก้วนำแสง',
      'd) สายโคเเอกเซียลแบบหนา',
    ],
  ),
  Question4(
    question4: '6.ข้อใดเป็นชนิดของสายใยแก้วนำแสง?',
    correctAnswerIndex4: 2,
    options4: [
      'a) แบบหุ้มฉนวน',
      'b) แบบไม่หุ้มฉนวน',
      'c) แบบมัลติโหมดและแบบซิงเกิลโหมด',
      'd) แบบเปลือย',
    ],
  ),
  Question4(
    question4: '7.สายที่ใช้รับส่งข้อมูลด้วยสัญญาณแสง คือสายชนิดใด?',
    correctAnswerIndex4: 0,
    options4: [
      'a) สายใยแก้วนำแสง',
      'b) สายโคเเอกเซียลแบบบาง',
      'c) สายโคเเอกเซียลแบบบาง',
      'd) สายคู่บิดเกลียว',
    ],
  ),
  Question4(
    question4: '8.การสื่อสารด้วยคลื่นวิทยุในแนวเส้นตรง เป็นการสื่อสารไร้สายแบบใด?',
    correctAnswerIndex4: 3,
    options4: [
      'a) การสื่อสารไร้สายแบบคลื่นบลูทูธ',
      'b) การสื่อสารไร้สายแบบคลื่นวิทยุ',
      'c) การสื่อสารไร้สายแบบอินฟราเรด',
      'd) การสื่อสารไร้สายแบบไมโครเวฟ',
    ],
  ),
  Question4(
    question4:
        '9.การสื่อสารด้วยคลื่นเเม่เหล็กไฟฟ้าที่มีความถี่ของแสงที่ต่ำกว่าแสงสีแดง เป็นการสื่อสารไร้สายแบบใด?',
    correctAnswerIndex4: 0,
    options4: [
      'a) การสื่อสารไร้สายแบบอินฟราเรด',
      'b) การสื่อสารไร้สายแบบคลื่นวิทยุ',
      'c) การสื่อสารไร้สายแบบคลื่นบลูทูธ',
      'd) การสื่อสารไร้สายแบบไมโครเวฟ',
    ],
  ),
  Question4(
    question4:
        '10.ข้อใดไม่ใช่สายใยแก้วนำแสงแบบมัลติโหมด MM(Multi-Mode)?',
    correctAnswerIndex4: 2,
    options4: [
      'a) Step-index',
      'b) Graded-index',
      'c) HTML-index',
      'd) ไม่มีข้อใดถูก',
    ],
  ),
];